In [3]:
import pandas as pd

data = [["Google", 10], ["Runoob", 12], ["Wiki", 13]]

# 创建DataFrame
df = pd.DataFrame(data, columns=["Site", "Age"])

# 使用astype方法设置每列的数据类型
df["Site"] = df["Site"].astype(str)
df["Age"] = df["Age"].astype(float)

df

     Site   Age
0  Google  10.0
1  Runoob  12.0
2    Wiki  13.0

In [5]:
import numpy as np

# 创建一个包含网站和年龄的二维ndarray
ndarray_data = np.array([["Google", 10], ["Runoob", 12], ["Wiki", 13]])

# 使用DataFrame构造函数创建数据帧
df2 = pd.DataFrame(ndarray_data, columns=["Site", "Age"])
df2

     Site Age
0  Google  10
1  Runoob  12
2    Wiki  13

In [6]:
df2.loc[[0, 1]]

     Site Age
0  Google  10
1  Runoob  12

In [17]:
# 从列表创建
df3 = pd.DataFrame(
    [[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=["Column1", "Column2", "Column3"]
)

df3

   Column1  Column2  Column3
0        1        2        3
1        4        5        6
2        7        8        9

In [18]:
df3['Column2'] = df3['Column2']*2

df3

   Column1  Column2  Column3
0        1        4        3
1        4       10        6
2        7       16        9